In [7]:
import pandas as pd
import numpy as np
import sqlite3

In [24]:
url_csv =  'https://github.com/ChawlaAvi/SQL-to-Pandas/blob/main/data.csv?raw=true'
df = pd.read_csv(url_csv)

In [25]:
df

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2        10/03/20
1   2      Julie    Miller      F   12000      2        14/01/20
2   3     Rachel      Bray      F    9000      1        09/03/20
3   4      Priti   Agarwal      F   10000      2        01/03/20
4   5      David       Cox      M    5000      1        28/05/20
5   6      Helly     Raval      F    8000      1        19/06/20
6   7       John     Frank      M   13000      3        12/11/19
7   8       Mark  Franklin      M   13500      3        12/11/19
8   9   Cristina       Rel      F   15000      4        22/09/19
9  10      Brock    Murray      M   11000      2        13/02/20

In [26]:
df["date_of_joining"] = pd.to_datetime(df.date_of_joining)

In [27]:
df

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2      2020-10-03
1   2      Julie    Miller      F   12000      2      2020-01-14
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
4   5      David       Cox      M    5000      1      2020-05-28
5   6      Helly     Raval      F    8000      1      2020-06-19
6   7       John     Frank      M   13000      3      2019-12-11
7   8       Mark  Franklin      M   13500      3      2019-12-11
8   9   Cristina       Rel      F   15000      4      2019-09-22
9  10      Brock    Murray      M   11000      2      2020-02-13

In [9]:
df.to_csv("data.csv")

In [11]:
pip install ipython-sql

Collecting ipython-sql
  Using cached ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\carlos\anaconda3\lib\site-packages (from ipython-sql) (1.3.20)
Requirement already satisfied: six in c:\users\carlos\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Collecting prettytable<1
  Using cached prettytable-0.7.2.zip (28 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Collecting sqlparse
  Using cached sqlparse-0.4.3-py3-none-any.whl (42 kB)
Requirement already satisfied: ipython>=1.0 in c:\users\carlos\anaconda3\lib\site-packages (from ipython-sql) (7.19.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\carlos\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: backcall in c:\users\carlos\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\carlos\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (50.3.1.post20201107)
Requirement already satisfied: colorama in c:\users\carlos\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: jedi>=0.10 in c:\users\carlos\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)
Requirement already satisfied: decorator in c:\users\carlos\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: pygments in c:\users\carlos\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.7.2)
Requirement already satisfied: pickleshare in c:\users\carlos\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in c:\users\carlos\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\carlos\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.8)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\carlos\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\carlos\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13705 sha256=35bb50dac2ca816ba12931bd51474d14361649f8adb3244b098e4f432373237b
  Stored in directory: c:\users\carlos\appdata\local\pip\cache\wheels\48\6d\77\9517cb933af254f51a446f1a5ec9c2be3e45f17384940bce68
Successfully built prettytable
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.4.1 prettytable-0.7.2 sqlparse-0.4.3
Note: you may need to restart the kernel to use updated packages.

WARNING: Ignoring invalid distribution -rpcio (c:\users\carlos\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rpcio (c:\users\carlos\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rpcio (c:\users\carlos\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rpcio (c:\users\carlos\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rpcio (c:\users\carlos\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rpcio (c:\users\carlos\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rpcio (c:\users\carlos\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rpcio (c:\users\carlos\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -rpcio (c:\users\carlos\anaconda3\lib\site-packages)
WARNING: You are using pip version 21.3.1; however, version 22.3.1 is available.
You should consider upgrading via the 'C:\Users\Carlos\anaconda3\python.exe -m pip install --upgrade pip' command.

In [12]:
%load_ext sql

In [13]:
%sql sqlite://

In [14]:
%%sql
drop table if exists employee;
CREATE TABLE employee
(
    ID       integer,
    first_name        varchar(20),
    last_name   varchar(20),
    gender varchar(2),
    salary     integer,
    level integer,
    date_of_joining date
);

INSERT INTO employee
values (1, 'Peter',    'Sanders',  'M', 10000, 2, '2020-03-10'),
       (2, 'Julie',    'Miller',   'F', 12000, 2, '2020-01-14'),
       (3, 'Rachel',   'Bray',     'F', 9000,  1, '2020-03-09'),
       (4, 'Priti',    'Agarwal',  'F', 10000, 2, '2020-03-01'),
       (5, 'David',    'Cox',      'M', 5000,  1, '2020-05-28'),
       (6, 'Helly',    'Raval',    'F', 8000,  1, '2020-06-19'),
       (7, 'John',     'Frank',    'M', 13000, 3, '2019-11-12'),
       (8, 'Mark',     'Franklin', 'M', 13500, 3, '2019-11-12'),
       (9, 'Cristina', 'Rel',      'F', 15000, 4, '2019-09-22'),
       (10, 'Brock',   'Murray',   'M', 11000, 2,' 2020-02-13');

 * sqlite://
Done.
Done.
10 rows affected.

[]

# Printing the Dimensions

In [122]:
df.shape

(10, 7)

In [123]:
%%sql
select count(1)
from employee;

 * sqlite://
Done.

[(10,)]

In [18]:
%%sql
select * 
from employee 
limit 15;

 * sqlite://
Done.

[(1, 'Peter', 'Sanders', 'M', 10000, 2, '2020-03-10'),
 (2, 'Julie', 'Miller', 'F', 12000, 2, '2020-01-14'),
 (3, 'Rachel', 'Bray', 'F', 9000, 1, '2020-03-09'),
 (4, 'Priti', 'Agarwal', 'F', 10000, 2, '2020-03-01'),
 (5, 'David', 'Cox', 'M', 5000, 1, '2020-05-28'),
 (6, 'Helly', 'Raval', 'F', 8000, 1, '2020-06-19'),
 (7, 'John', 'Frank', 'M', 13000, 3, '2019-11-12'),
 (8, 'Mark', 'Franklin', 'M', 13500, 3, '2019-11-12'),
 (9, 'Cristina', 'Rel', 'F', 15000, 4, '2019-09-22'),
 (10, 'Brock', 'Murray', 'M', 11000, 2, ' 2020-02-13')]

In [124]:
df.dtypes

ID                          int64
first_name                 object
last_name                  object
gender                     object
salary                      int64
level                       int64
date_of_joining    datetime64[ns]
dtype: object

In [125]:
%%sql
describe employee;

 * sqlite://
(sqlite3.OperationalError) near "describe": syntax error
[SQL: describe employee;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

# Modifying the Datatype of a column

In [126]:
df.ID.astype(str)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: ID, dtype: object

In [129]:
%%sql
alter table employee
alter column ID varchar(5);

 * sqlite://
(sqlite3.OperationalError) near "alter": syntax error
[SQL: alter table employee
alter column ID varchar(5);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [130]:
%%sql
select cast (ID as string)
from employee;

 * sqlite://
Done.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,)]

# Select with Condition on One (or more) Columns

### One Condition

In [20]:
%%sql
select * 
from employee 
where level == 3;

 * sqlite://
Done.

[(7, 'John', 'Frank', 'M', 13000, 3, '2019-11-12'),
 (8, 'Mark', 'Franklin', 'M', 13500, 3, '2019-11-12')]

In [31]:
df[df['level'] == 3]

   ID first_name last_name gender  salary  level date_of_joining
6   7       John     Frank      M   13000      3      2019-12-11
7   8       Mark  Franklin      M   13500      3      2019-12-11

In [32]:
df[df.level==3]

   ID first_name last_name gender  salary  level date_of_joining
6   7       John     Frank      M   13000      3      2019-12-11
7   8       Mark  Franklin      M   13500      3      2019-12-11

In [132]:
%%sql
select * 
from employee 
where level == 2 and gender == 'M';

 * sqlite://
Done.

[(1, 'Peter', 'Sanders', 'M', 10000, 2, '2020-03-10'),
 (10, 'Brock', 'Murray', 'M', 11000, 2, ' 2020-02-13')]

In [138]:
df.loc[(df['level']== 2) & (df['gender'] == 'M')]

   ID first_name last_name gender  salary  level date_of_joining
0   1      Peter   Sanders      M   10000      2      2020-10-03
9  10      Brock    Murray      M   11000      2      2020-02-13

# Select a Subset of Columns

In [49]:
%%sql
select
first_name, gender, date_of_joining
from employee
where salary > 10000;

 * sqlite://
Done.

[('Julie', 'F', '2020-01-14'),
 ('John', 'M', '2019-11-12'),
 ('Mark', 'M', '2019-11-12'),
 ('Cristina', 'F', '2019-09-22'),
 ('Brock', 'M', ' 2020-02-13')]

In [105]:
filt = (df['salary'] > 10000)

In [107]:
df.loc[filt,['first_name','gender','date_of_joining']]

  first_name gender date_of_joining
1      Julie      F      2020-01-14
6       John      M      2019-12-11
7       Mark      M      2019-12-11
8   Cristina      F      2019-09-22
9      Brock      M      2020-02-13

# Sorting the records based on Column values

In [116]:
%%sql
select *
from employee
order by 
gender DESC,
salary ASC;

 * sqlite://
Done.

[(5, 'David', 'Cox', 'M', 5000, 1, '2020-05-28'),
 (1, 'Peter', 'Sanders', 'M', 10000, 2, '2020-03-10'),
 (10, 'Brock', 'Murray', 'M', 11000, 2, ' 2020-02-13'),
 (7, 'John', 'Frank', 'M', 13000, 3, '2019-11-12'),
 (8, 'Mark', 'Franklin', 'M', 13500, 3, '2019-11-12'),
 (6, 'Helly', 'Raval', 'F', 8000, 1, '2020-06-19'),
 (3, 'Rachel', 'Bray', 'F', 9000, 1, '2020-03-09'),
 (4, 'Priti', 'Agarwal', 'F', 10000, 2, '2020-03-01'),
 (2, 'Julie', 'Miller', 'F', 12000, 2, '2020-01-14'),
 (9, 'Cristina', 'Rel', 'F', 15000, 4, '2019-09-22')]

In [119]:
df.sort_values(['gender',"salary"],ascending=[0,1])

   ID first_name last_name gender  salary  level date_of_joining
4   5      David       Cox      M    5000      1      2020-05-28
0   1      Peter   Sanders      M   10000      2      2020-10-03
9  10      Brock    Murray      M   11000      2      2020-02-13
6   7       John     Frank      M   13000      3      2019-12-11
7   8       Mark  Franklin      M   13500      3      2019-12-11
5   6      Helly     Raval      F    8000      1      2020-06-19
2   3     Rachel      Bray      F    9000      1      2020-09-03
3   4      Priti   Agarwal      F   10000      2      2020-01-03
1   2      Julie    Miller      F   12000      2      2020-01-14
8   9   Cristina       Rel      F   15000      4      2019-09-22

# Grouping records

In [139]:
%%sql 
select level, 
round(avg(salary), 2) as avg_salary, 
count(*) as count
from employee 
group by level;

 * sqlite://
Done.

[(1, 7333.33, 3), (2, 10750.0, 4), (3, 13250.0, 2), (4, 15000.0, 1)]

In [197]:
df.groupby('level').salary.mean().reset_index().round(2).rename(columns={'salary':'avg_salary'})

   level  avg_salary
0      1     7333.33
1      2    10750.00
2      3    13250.00
3      4    15000.00

In [191]:
df.groupby(['level']).mean().sort_values('salary').reset_index().rename(columns={'salary':'avg_salary'})

   level        ID    avg_salary
0      1  4.666667   7333.333333
1      2  4.250000  10750.000000
2      3  7.500000  13250.000000
3      4  9.000000  15000.000000

In [151]:
level_grp = df.groupby(['level'])
level_grp.get_group(1)

   ID first_name last_name gender  salary  level date_of_joining
2   3     Rachel      Bray      F    9000      1      2020-09-03
4   5      David       Cox      M    5000      1      2020-05-28
5   6      Helly     Raval      F    8000      1      2020-06-19

In [152]:
df.groupby(['level']).get_group(1)

   ID first_name last_name gender  salary  level date_of_joining
2   3     Rachel      Bray      F    9000      1      2020-09-03
4   5      David       Cox      M    5000      1      2020-05-28
5   6      Helly     Raval      F    8000      1      2020-06-19

# Number of Distinct records

In [163]:
%%sql
select distinct level from employee;

 * sqlite://
Done.

[(2,), (1,), (3,), (4,)]

In [164]:
%%sql
select count(distinct level) from employee;

 * sqlite://
Done.

[(4,)]

# Number of Rows in the Table

In [165]:
%%sql
select count(*) from employee;

 * sqlite://
Done.

[(10,)]

# Perform some complex pattern-based string filtering

In [169]:
%%sql
select * from employee
where first_name LIKE "J%";

 * sqlite://
Done.

[(2, 'Julie', 'Miller', 'F', 12000, 2, '2020-01-14'),
 (7, 'John', 'Frank', 'M', 13000, 3, '2019-11-12')]

# Search for a substring within a string. 
For instance, say we want to find all the records in which last_name contains the substring “an"

In [170]:
%%sql
select * from employee
where last_name LIKE "%an%";

 * sqlite://
Done.

[(1, 'Peter', 'Sanders', 'M', 10000, 2, '2020-03-10'),
 (7, 'John', 'Frank', 'M', 13000, 3, '2019-11-12'),
 (8, 'Mark', 'Franklin', 'M', 13500, 3, '2019-11-12')]

# Fill NaN values
For this one, I have intentionally removed a couple of values in the salary column. This is the updated DataFrame: